#!/usr/bin/python
# -*- coding: utf-8 -*-

"""
術數基礎 陰陽、五行、方向、天干、
"""
類別 太極(物件):
    """
    道生萬物
    """
    定義 __字串__(我):
        返回 我.名稱


類別 兩儀(太極):
    """
    陰、陽
    """
    定義 __初始化__(我, 名稱, 數字):
        我.名稱 = 名稱
        我.數字 = 數字

陰 = 兩儀(名稱 = "陰", 數字 = 0)
陽 = 兩儀(名稱 = "陽", 數字 = 1)


類別 方向(物件):
    """
    東、西、南、北
    """
    定義 __初始化__(我, 名稱):
        我.名稱 = 名稱

    定義 __字串__(我):
        返回 我.名稱

東 = 方向("東")
西 = 方向("西")
南 = 方向("南")
北 = 方向("北")
中 = 方向("中")


類別 天干(物件):
    """
    天干參數
    """
    定義 __初始化__(我, 名稱, 陰陽):
        我.名稱 = 名稱
        我.陰陽 = 陰陽

    定義 __字串__(我):
        返回 我.名稱

甲 = 天干(名稱 = '甲', 陰陽 = 陽)
乙 = 天干(名稱 = '乙', 陰陽 = 陰)
丙 = 天干(名稱 = '丙', 陰陽 = 陽)
丁 = 天干(名稱 = '丁', 陰陽 = 陰)
戊 = 天干(名稱 = '戊', 陰陽 = 陽)
己 = 天干(名稱 = '己', 陰陽 = 陰)
庚 = 天干(名稱 = '庚', 陰陽 = 陽)
辛 = 天干(名稱 = '辛', 陰陽 = 陰)
壬 = 天干(名稱 = '壬', 陰陽 = 陽)
癸 = 天干(名稱 = '癸', 陰陽 = 陰)

天干表 = [甲, 乙, 丙, 丁, 戊, 己, 庚, 辛, 壬, 癸]


類別 地支(物件):
    """
    地支參數
    """
    定義 __初始化__(我, 名稱, 陰陽, 方向, 時間):
        我.名稱 = 名稱
        我.陰陽 = 陰陽
        我.方向 = 方向
        我.時間 = 時間

    定義 __字串__(我):
        返回 我.名稱

子 = 地支(名稱 = '子', 陰陽 = 陽, 方向= 北, 時間=(23, 1))
丑 = 地支(名稱 = '丑', 陰陽 = 陰, 方向= 北, 時間=(1, 3))
寅 = 地支(名稱 = '寅', 陰陽 = 陽, 方向= 北, 時間=(3, 5))
卯 = 地支(名稱 = '卯', 陰陽 = 陰, 方向= 西, 時間=(5, 7))
辰 = 地支(名稱 = '辰', 陰陽 = 陽, 方向= 西, 時間=(7, 9))
巳 = 地支(名稱 = '巳', 陰陽 = 陰, 方向= 西, 時間=(9, 11))
午 = 地支(名稱 = '午', 陰陽 = 陽, 方向= 南, 時間=(11, 13))
未 = 地支(名稱 = '未', 陰陽 = 陰, 方向= 南, 時間=(13, 15))
申 = 地支(名稱 = '申', 陰陽 = 陽, 方向= 南, 時間=(15, 17))
酉 = 地支(名稱 = '酉', 陰陽 = 陰, 方向= 東, 時間=(17, 19))
戌 = 地支(名稱 = '戌', 陰陽 = 陽, 方向= 東, 時間=(19, 21))
亥 = 地支(名稱 = '亥', 陰陽 = 陰, 方向= 東, 時間=(21, 23))

地支表 = [子, 丑, 寅, 卯, 辰, 巳, 午, 未, 申, 酉, 戌, 亥]

